datomusic/duo-imxrt/brains2/components/codec/da7212/fsl_dialog7212.h
/* DIALOG7212_DAC_NG_ON_THRESH                   0xB1 */
#define DIALOG7212_DAC_NG_ON_THRESHOLD_MASK  (0x07)
#define DIALOG7212_DAC_NG_ON_THRESHOLD_SHIFT (0U)
#define DIALOG7212_DAC_NG_ON_THRESHOLD_N90DB (0U << DIALOG7212_DAC_NG_ON_THRESHOLD_SHIFT)
#define DIALOG7212_DAC_NG_ON_THRESHOLD_N84DB (1U << DIALOG7212_DAC_NG_ON_THRESHOLD_SHIFT)
#define DIALOG7212_DAC_NG_ON_THRESHOLD_N78DB (2U << DIALOG7212_DAC_NG_ON_THRESHOLD_SHIFT)
#define DIALOG7212_DAC_NG_ON_THRESHOLD_N72DB (3U << DIALOG7212_DAC_NG_ON_THRESHOLD_SHIFT)
#define DIALOG7212_DAC_NG_ON_THRESHOLD_N66DB (4U << DIALOG7212_DAC_NG_ON_THRESHOLD_SHIFT)
#define DIALOG7212_DAC_NG_ON_THRESHOLD_N60DB (5U << DIALOG7212_DAC_NG_ON_THRESHOLD_SHIFT)
#define DIALOG7212_DAC_NG_ON_THRESHOLD_N54DB (6U << DIALOG7212_DAC_NG_ON_THRESHOLD_SHIFT)
#define DIALOG7212_DAC_NG_ON_THRESHOLD_N48DB (7U << DIALOG7212_DAC_NG_ON_THRESHOLD_SHIFT)

/* DIALOG7212_DAC_NG_CTRL                        0xB2 */
#define DIALOG7212_DAC_NG_CTRL_EN_MASK (1U << 7)

/*************Tone Generation & Beep Registers************/
/* DIALOG7212_TONE_GEN_CFG1                      0xB4 */
#define DIALOG7212_TONE_GEN_CFG1_START_STOPN_MASK (1U << 7)
#define DIALOG7212_TONE_GEN_CFG1_DMTF_EN_MASK     (1U << 4)
#define DIALOG7212_TONE_GEN_CFG1_DMTF_REG_MASK    (0x0F)
#define DIALOG7212_TONE_GEN_CFG1_DMTF_REG_SHIFT   (0U)
#define DIALOG7212_TONE_GEN_CFG1_DMTF_REG(x)      ((x) << DIALOG7212_TONE_GEN_CFG1_DMTF_REG_SHIFT)

/* DIALOG7212_TONE_GEN_CFG2                      0xB5 */
#define DIALOG7212_TONE_GEN_CFG2_GAIN_MASK         (0xF0)
#define DIALOG7212_TONE_GEN_CFG2_GAIN_SHIFT        (4U)
#define DIALOG7212_TONE_GEN_CFG2_GAIN(x)           ((x) << DIALOG7212_TONE_GEN_CFG2_GAIN_SHIFT)
#define DIALOG7212_TONE_GEN_CFG2_SWG_SEL_MASK      (0x03)
#define DIALOG7212_TONE_GEN_CFG2_SWG_SEL_SHIFT     (0U)
#define DIALOG7212_TONE_GEN_CFG2_SWG_SEL_SUM__BOTH (0U << DIALOG7212_TONE_GEN_CFG2_SWG_SEL_SHIFT)
#define DIALOG7212_TONE_GEN_CFG2_SWG_SEL_SWG1_ONLY (1U << DIALOG7212_TONE_GEN_CFG2_SWG_SEL_SHIFT)
#define DIALOG7212_TONE_GEN_CFG2_SWG_SEL_SWG2_ONLY (2U << DIALOG7212_TONE_GEN_CFG2_SWG_SEL_SHIFT)
#define DIALOG7212_TONE_GEN_CFG2_SWG_SEL_SUM_BOTH  (3U << DIALOG7212_TONE_GEN_CFG2_SWG_SEL_SHIFT)

/* DIALOG7212_TONE_GEN_CYCLES                    0xB6 */
#define DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_MASK     (0x07)
#define DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_SHIFT    (0U)
#define DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_1        (0U << DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_SHIFT)
#define DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_2        (1U << DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_SHIFT)
#define DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_4        (2U << DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_SHIFT)
#define DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_8        (3U << DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_SHIFT)
#define DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_16       (4U << DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_SHIFT)
#define DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_32       (5U << DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_SHIFT)
#define DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_INFINITE (6U << DIALOG7212_TONE_GEN_CYCLES_BEEP_CYCLES_SHIFT)

/* DIALOG7212_TONE_GEN_FREQ1_L                   0xB7 */
#define DIALOG7212_TONE_GEN_FREQ1_L_MASK   (0xFF)
#define DIALOG7212_TONE_GEN_FREQ1_L_SHIFT  (0U)
#define DIALOG7212_TONE_GEN_FREQ1_L_VAL(x) ((x) << DIALOG7212_TONE_GEN_FREQ1_L_SHIFT)

/* DIALOG7212_TONE_GEN_FREQ1_U                   0xB8 */
#define DIALOG7212_TONE_GEN_FREQ1_U_MASK   (0xFF)
#define DIALOG7212_TONE_GEN_FREQ1_U_SHIFT  (0U)
#define DIALOG7212_TONE_GEN_FREQ1_U_VAL(x) ((x) << DIALOG7212_TONE_GEN_FREQ1_U_SHIFT)

/* DIALOG7212_TONE_GEN_FREQ2_L                   0xB9 */
#define DIALOG7212_TONE_GEN_FREQ2_L_MASK   (0xFF)
#define DIALOG7212_TONE_GEN_FREQ2_L_SHIFT  (0U)
#define DIALOG7212_TONE_GEN_FREQ2_L_VAL(x) ((x) << DIALOG7212_TONE_GEN_FREQ2_L_SHIFT)

/* DIALOG7212_TONE_GEN_FREQ2_U                   0xBA */
#define DIALOG7212_TONE_GEN_FREQ2_U_MASK   (0xFF)
#define DIALOG7212_TONE_GEN_FREQ2_U_SHIFT  (0U)
#define DIALOG7212_TONE_GEN_FREQ2_U_VAL(x) ((x) << DIALOG7212_TONE_GEN_FREQ2_U_SHIFT)

/* DIALOG7212_TONE_GEN_ON_PER                    0xBB */
#define DIALOG7212_TONE_GEN_ON_PER_BEEP_ON_PER_MASK  (0x3F)
#define DIALOG7212_TONE_GEN_ON_PER_BEEP_ON_PER_SHIFT (0U)
#define DIALOG7212_TONE_GEN_ON_PER_BEEP_ON_PER(x)    ((x) << DIALOG7212_TONE_GEN_ON_PER_BEEP_ON_PER_SHIFT)

/* DIALOG7212_TONE_GEN_OFF_PER                   0xBC */
#define DIALOG7212_TONE_GEN_OFF_PER_BEEP_OFF_PER_MASK  (0x3F)
#define DIALOG7212_TONE_GEN_OFF_PER_BEEP_OFF_PER_SHIFT (0U)
#define DIALOG7212_TONE_GEN_OFF_PER_BEEP_OFF_PER(x)    ((x) << DIALOG7212_TONE_GEN_OFF_PER_BEEP_OFF_PER_SHIFT)

/*************System Controller Registers(2)*************/
/* DIALOG7212_SYSTEM_STATUS                      0xE0 */
#define DIALOG7212_SYSTEM_STATUS_SC2_BUSY_MASK (1U << 1)
#define DIALOG7212_SYSTEM_STATUS_SC1_BUSY_MASK (1U << 0)

/* DIALOG7212_SYSTEM_ACTIVE                      0xFD */
#define DIALOG7212_SYSTEM_ACTIVE_MASK (1U << 0)

/*! @brief da7212 volume setting range */
#define DA7212_HEADPHONE_MAX_VOLUME_VALUE 0x3FU

/*! @brief DA7212 input source select */
typedef enum _da7212_Input
{
    kDA7212_Input_AUX = 0x0, /*!< Input from AUX */
    kDA7212_Input_MIC1_Dig,  /*!< Input from MIC1 Digital */
    kDA7212_Input_MIC1_An,   /*!< Input from Mic1 Analog */
    kDA7212_Input_MIC2,      /*!< Input from MIC2 */
    kDA7212_Input_MAX
} da7212_Input_t;

/*! @brief da7212 play channel  */
enum _da7212_play_channel
{
    kDA7212_HeadphoneLeft  = 1U, /*!< headphone left */
    kDA7212_HeadphoneRight = 2U, /*!< headphone right */
    kDA7212_Speaker        = 4U, /*!< speaker channel */
};

/*! @brief DA7212 output device select */
typedef enum _da7212_Output
{
    kDA7212_Output_HP = 0x0, /*!< Output to headphone */
    kDA7212_Output_SP,       /*!< Output to speaker */
    kDA7212_Output_MAX
} da7212_Output_t;

/*! @brief DA7212 module */
enum _da7212_module
{
    kDA7212_ModuleADC,       /*!< module ADC*/
    kDA7212_ModuleDAC,       /*!< module DAC */
    kDA7212_ModuleHeadphone, /*!< module headphone */
    kDA7212_ModuleSpeaker,   /*!< module speaker */
};

/*! @brief DA7212 functionality */
typedef enum _da7212_dac_source
{
    kDA7212_DACSourceADC         = 0x0U, /*!< DAC source from ADC */
    kDA7212_DACSourceInputStream = 0x3U  /*!< DAC source from  */
} da7212_dac_source_t;

/*! @brief DA7212 volume */
typedef enum _da7212_volume
{
    kDA7212_DACGainMute  = 0x7,  /*!< Mute DAC */
    kDA7212_DACGainM72DB = 0x17, /*!< DAC volume -72db */
    kDA7212_DACGainM60DB = 0x1F, /*!< DAC volume -60db */
    kDA7212_DACGainM54DB = 0x27, /*!< DAC volume -54db */
    kDA7212_DACGainM48DB = 0x2F, /*!< DAC volume -48db */
    kDA7212_DACGainM42DB = 0x37, /*!< DAC volume -42db */
    kDA7212_DACGainM36DB = 0x3F, /*!< DAC volume -36db */
    kDA7212_DACGainM30DB = 0x47, /*!< DAC volume -30db */
    kDA7212_DACGainM24DB = 0x4F, /*!< DAC volume -24db */
    kDA7212_DACGainM18DB = 0x57, /*!< DAC volume -18db */
    kDA7212_DACGainM12DB = 0x5F, /*!< DAC volume -12db */
    kDA7212_DACGainM6DB  = 0x67, /*!< DAC volume -6bb */
    kDA7212_DACGain0DB   = 0x6F, /*!< DAC volume +0db */
    kDA7212_DACGain6DB   = 0x77, /*!< DAC volume +6db */
    kDA7212_DACGain12DB  = 0x7F  /*!< DAC volume +12db */
} da7212_volume_t;

/*!
 * @brief The audio data transfer protocol choice.
 */
typedef enum _da7212_protocol
{
    kDA7212_BusI2S = 0x0,      /*!< I2S Type */
    kDA7212_BusLeftJustified,  /*!< Left justified */
    kDA7212_BusRightJustified, /*!< Right Justified */
    kDA7212_BusDSPMode,        /*!< DSP mode */
} da7212_protocol_t;

/*! @brief da7212 system clock source */
typedef enum _da7212_sys_clk_source
{
    kDA7212_SysClkSourceMCLK = 0U,       /*!< da7212 system clock soure from MCLK */
    kDA7212_SysClkSourcePLL  = 1U << 14, /*!< da7212 system clock soure from pLL */
} da7212_sys_clk_source_t;

/*! @brief DA7212 pll clock source */
typedef enum _da7212_pll_clk_source
{
    kDA7212_PLLClkSourceMCLK = 0U, /*!< DA7212 PLL clock source from MCLK */
} da7212_pll_clk_source_t;

/*! @brief DA7212 output clock frequency */
typedef enum _da7212_pll_out_clk
{
    kDA7212_PLLOutputClk11289600 = 11289600U, /*!< output 112896000U */
    kDA7212_PLLOutputClk12288000 = 12288000U, /*!< output 12288000U */
} da7212_pll_out_clk_t;

/*!@brief master mode bits per frame */
typedef enum _da7212_master_bits
{
    kDA7212_MasterBits32PerFrame  = 0U, /*!< master mode bits32 per frame */
    kDA7212_MasterBits64PerFrame  = 1U, /*!< master mode bits64 per frame */
    kDA7212_MasterBits128PerFrame = 2U, /*!< master mode bits128 per frame */
    kDA7212_MasterBits256PerFrame = 3U, /*!< master mode bits256 per frame */
} da7212_master_bits_t;

